Revit 2026 API
Document.NewRoom(Room, PlanCircuit) Method
 Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Room NewRoom(
	Room room,
	PlanCircuit circuit
)
Public Function NewRoom (
	room As Room,
	circuit As PlanCircuit
) As Room
public:
Room^ NewRoom(
	Room^ room,
	PlanCircuit^ circuit
)
member NewRoom :
        room : Room *
        circuit : PlanCircuit -> Room
Parameters
room Room
 The room which you want to locate in the circuit. Pass null to create a new room.
circuit PlanCircuit
 The circuit in which you want to locate a room.
Return Value
Room
 If successful the room is returned, otherwise null.
Exceptions
Exception | Condition
InvalidOperationException | If the existing room is already placed.
ArgumentException | Thrown if the room does not exist in the given document.
ArgumentException | Thrown if the circuit does not exist in the given document.
InvalidOperationException | Thrown if the level obtained from the circuit has no associated view .
Remarks
 This method will regenerate the document even in manual regeneration mode.
See Also
Reference
Document Class
NewRoom Overload
Autodesk.Revit.Creation Namespace